Revit 2027 API
PointCloudInstance.GetSelectionFilter Method
 Returns the currently active selection filter for this point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudFilter GetSelectionFilter()
Public Function GetSelectionFilter As PointCloudFilter
public:
PointCloudFilter^ GetSelectionFilter()
member GetSelectionFilter : unit -> PointCloudFilter
Return Value
PointCloudFilter
 Currently active selection filter or null if none is active.
See Also
Reference
PointCloudInstance Class
Autodesk.Revit.DB Namespace